Revit 2027 API
ModelCurveArrArray.Item Property
Gets or sets an item at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ModelCurveArray this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As ModelCurveArray
	Get
	Set
public:
virtual property ModelCurveArray^ Item[int index] {
	ModelCurveArray^ get (int index);
	void set (int index, ModelCurveArray^ value);
}
abstract Item : ModelCurveArray with get, set
override Item : ModelCurveArray with get, set
Parameters
index Int32
The index of the item to be set or retrieved.
Return Value
ModelCurveArray
Returns the object at the specified index.
See Also
Reference
ModelCurveArrArray Class
Autodesk.Revit.DB Namespace